gdgly/stm32L151_nbiot_tmote_app_spot/Libraries/NBIot/nbiotfunc.c
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+CCLK?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+CCLK?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if ( sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, 
			"\r\n+CCLK:%d/%d/%d,%d:%d:%d+%d\r", 
			&pClient->Parameter.dataTime.year, 
			&pClient->Parameter.dataTime.month, 
			&pClient->Parameter.dataTime.day, 
			&pClient->Parameter.dataTime.hour, 
			&pClient->Parameter.dataTime.min, 
			&pClient->Parameter.dataTime.sec, 
			&zoneTime) <= 0) {
			pClient->Parameter.dataTime.year		= 18;
			pClient->Parameter.dataTime.month		= 01;
			pClient->Parameter.dataTime.day		= 01;
			pClient->Parameter.dataTime.hour		= 00;
			pClient->Parameter.dataTime.min		= 00;
			pClient->Parameter.dataTime.sec		= 00;
			NBStatus = NBIOT_ERROR;
		}
		else {
			pClient->Parameter.dataTime.localstamp = RTC_TimeToStamp(pClient->Parameter.dataTime.year, 
														  pClient->Parameter.dataTime.month, 
														  pClient->Parameter.dataTime.day, 
														  pClient->Parameter.dataTime.hour, 
														  pClient->Parameter.dataTime.min, 
														  pClient->Parameter.dataTime.sec) + (zoneTime * 15 * 60);
			Datetime = RTC_ConvUnixToCalendar(pClient->Parameter.dataTime.localstamp);
			pClient->Parameter.dataTime.year		= Datetime.tm_year;
			pClient->Parameter.dataTime.month		= Datetime.tm_mon;
			pClient->Parameter.dataTime.day		= Datetime.tm_mday;
			pClient->Parameter.dataTime.hour		= Datetime.tm_hour;
			pClient->Parameter.dataTime.min		= Datetime.tm_min;
			pClient->Parameter.dataTime.sec		= Datetime.tm_sec;
			NBStatus = NBIOT_OK;
		}
	}
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadPowerSavingModeStatus(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadPowerSavingModeStatus	: 查询终端PSM状态
 @Input				pClient									: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef							: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadPowerSavingModeStatus(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	Stm32_CalculagraphTypeDef ATCmd_timer_Ms;
	
	Stm32_Calculagraph_CountdownMS(&ATCmd_timer_Ms, pClient->Command_Timeout_Msec);
	pClient->ATCmdStack->CmdWaitTime = ATCmd_timer_Ms;
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NPSMR=1\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+NPSMR=1\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) != NBIOT_OK) {
		goto exit;
	}
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NPSMR?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+NPSMR?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NPSMR:1,1")) {
			pClient->Parameter.psmstate = PowerSavingMode;
		}
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NPSMR:1,0")) {
			pClient->Parameter.psmstate = NormalMode;
		}
		else {
			NBStatus = NBIOT_ERROR;
			goto exit;
		}
	}
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NPSMR=0\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+NPSMR=0\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) != NBIOT_OK) {
		goto exit;
	}
	
exit:
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadSignalConnectionStatus(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadSignalConnectionStatus	: 查询终端Connected状态
 @Input				pClient									: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef							: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadSignalConnectionStatus(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	Stm32_CalculagraphTypeDef ATCmd_timer_Ms;
	
	Stm32_Calculagraph_CountdownMS(&ATCmd_timer_Ms, pClient->Command_Timeout_Msec);
	pClient->ATCmdStack->CmdWaitTime = ATCmd_timer_Ms;
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+CSCON?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+CSCON?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		/* Connected */
		if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+CSCON:0,1")) {
			pClient->Parameter.connectedstate = ConnectedMode;
		}
		/* Idle */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+CSCON:0,0")) {
			pClient->Parameter.connectedstate = IdleMode;
		}
		else {
			NBStatus = NBIOT_ERROR;
		}
	}
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetAttachOrDetach(NBIOT_ClientsTypeDef* pClient, NBIOT_NetstateTypeDef attdet)
 @Description			NBIOT_Neul_NBxx_SetAttachOrDetach			: 设置终端入网退网
 @Input				pClient								: NBIOT客户端实例
					attdet								: Detach / Attach
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetAttachOrDetach(NBIOT_ClientsTypeDef* pClient, NBIOT_NetstateTypeDef attdet)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	Stm32_CalculagraphTypeDef ATCmd_timer_Ms;
	
	Stm32_Calculagraph_CountdownMS(&ATCmd_timer_Ms, pClient->Command_Timeout_Msec);
	pClient->ATCmdStack->CmdWaitTime = ATCmd_timer_Ms;
	
	if (attdet == Detach) {												//退网
		sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+CGATT=0\r");
		pClient->ATCmdStack->ATSendlen = strlen("AT+CGATT=0\r");
	}
	else if (attdet == Attach) {											//入网
		sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+CGATT=1\r");
		pClient->ATCmdStack->ATSendlen = strlen("AT+CGATT=1\r");
	}
	else {
		NBStatus = NBIOT_ERROR;
	}
	
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadAttachOrDetach(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadAttachOrDetach		: 查询终端入网退网
 @Input				pClient								: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadAttachOrDetach(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	Stm32_CalculagraphTypeDef ATCmd_timer_Ms;
	
	Stm32_Calculagraph_CountdownMS(&ATCmd_timer_Ms, pClient->Command_Timeout_Msec);
	pClient->ATCmdStack->CmdWaitTime = ATCmd_timer_Ms;
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+CGATT?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+CGATT?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+CGATT:1")) {
			pClient->Parameter.netstate = Attach;
		}
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+CGATT:0")) {
			pClient->Parameter.netstate = Detach;
		}
		else {
			NBStatus = NBIOT_ERROR;
		}
	}
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetMinOrFullFunc(NBIOT_ClientsTypeDef* pClient, NBIOT_FunctionalityTypeDef minfull)
 @Description			NBIOT_Neul_NBxx_SetMinOrFullFunc			: 设置设备功能
 @Input				pClient								: NBIOT客户端实例
					minfull								: MinFunc / FullFunc
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetMinOrFullFunc(NBIOT_ClientsTypeDef* pClient, NBIOT_FunctionalityTypeDef minfull)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	Stm32_CalculagraphTypeDef ATCmd_timer_Ms;
	
	Stm32_Calculagraph_CountdownMS(&ATCmd_timer_Ms, pClient->Command_Timeout_Msec);
	pClient->ATCmdStack->CmdWaitTime = ATCmd_timer_Ms;
	
	if (minfull == MinFunc) {											//最小功能
		sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+CFUN=0\r");
		pClient->ATCmdStack->ATSendlen = strlen("AT+CFUN=0\r");
	}
	else if (minfull == FullFunc) {										//全功能
		sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+CFUN=1\r");
		pClient->ATCmdStack->ATSendlen = strlen("AT+CFUN=1\r");
	}
	else {
		NBStatus = NBIOT_ERROR;
	}
	
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadMinOrFullFunc(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadMinOrFullFunc		: 查询设备功能
 @Input				pClient								: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadMinOrFullFunc(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	Stm32_CalculagraphTypeDef ATCmd_timer_Ms;
	
	Stm32_Calculagraph_CountdownMS(&ATCmd_timer_Ms, pClient->Command_Timeout_Msec);
	pClient->ATCmdStack->CmdWaitTime = ATCmd_timer_Ms;
	
